import {DataPageType} from './data-page.type';

export const PageData: DataPageType[] = [
  {
    header: "Что такое\n" +
      "фан-клуб? ",
    beforeImage: "это инструмент для построения и управления собственной фан-базой.\n" +
      "Без посредников, без алгоритмов соцсетей.\n" +
      "Твоя аудитория — твоя сила и твой актив. ",
    passToImage: "images/image-4.webp",
    afterImage: "Пользователи могут вступать в клуб, слушать музыку, зарабатывать очки, приглашать друзей, а самое главное становится реальными фанатами, благодаря уникальной геймифицированной системе.",
    button: "ДАлее"
  },
  {
    header: "Возможности фан-клуба",
    beforeImage: "Фан-клуб непрерывно эволюционирует, предлагая новые способы взаимодействия с фанатами. Основная задача фан-клуба — создать глубокую связь со своей аудиторией.",
    list: {
      head: "Сейчас ты можешь:",
      body: [
        "Загружать свою музыку (включая неизданные треки)",
        "Видеть топ самых активных фанатов",
        "Участвовать в конкурсах",
        "Создать свой тотем и и его уникальную коллекцию",
      ],
    },
    passToImage: "images/image-4-_1_.webp",
    afterImage: "",
    button: "ДАлее"
  },
  {
    header: "Возможности фан-клуба",
    beforeImage: "Главная сила фан-клуба — это создание активного, преданного сообщества вокруг артиста, где каждый слушатель не просто потребляет музыку, а участвует в её продвижении, поддержке и развитии.",
    list: {
      head: "В скором будущем:",
      body: [
        "Выпуск лимитированных коллекций треков",
        "Лента активности с эксклюзивными механиками",
        "Новые способы монетизации",
      ]
    },
    afterImage: "",
    passToImage: "images/image-4-_2_.webp",
    button: "Создать клуб"
  },
]
